**å¤ä¹ ï¼š**æ•°æ®åˆ†æçš„ç¬¬ä¸€æ­¥ï¼ŒåŠ è½½æ•°æ®æˆ‘ä»¬å·²ç»å­¦ä¹ å®Œæ¯•äº†ã€‚å½“æ•°æ®å±•ç°åœ¨æˆ‘ä»¬é¢å‰çš„æ—¶å€™ï¼Œæˆ‘ä»¬æ‰€è¦åšçš„ç¬¬ä¸€æ­¥å°±æ˜¯è®¤è¯†ä»–ï¼Œä»Šå¤©æˆ‘ä»¬è¦å­¦ä¹ çš„å°±æ˜¯**äº†è§£å­—æ®µå«ä¹‰ä»¥åŠåˆæ­¥è§‚å¯Ÿæ•°æ®**ã€‚

## 1 ç¬¬ä¸€ç« ï¼šæ•°æ®è½½å…¥åŠåˆæ­¥è§‚å¯Ÿ

### 1.4 çŸ¥é“ä½ çš„æ•°æ®å«ä»€ä¹ˆ
æˆ‘ä»¬å­¦ä¹ pandasçš„åŸºç¡€æ“ä½œï¼Œé‚£ä¹ˆä¸Šä¸€èŠ‚é€šè¿‡pandasåŠ è½½ä¹‹åçš„æ•°æ®ï¼Œå…¶æ•°æ®ç±»å‹æ˜¯ä»€ä¹ˆå‘¢ï¼Ÿ

**å¼€å§‹å‰å¯¼å…¥numpyå’Œpandas**

In [2]:
import numpy as np
import pandas as pd

#### 1.4.1 ä»»åŠ¡ä¸€ï¼špandasä¸­æœ‰ä¸¤ä¸ªæ•°æ®ç±»å‹DateFrameå’ŒSeriesï¼Œé€šè¿‡æŸ¥æ‰¾ç®€å•äº†è§£ä»–ä»¬ã€‚ç„¶åè‡ªå·±å†™ä¸€ä¸ªå…³äºè¿™ä¸¤ä¸ªæ•°æ®ç±»å‹çš„å°ä¾‹å­ğŸŒ°[å¼€æ”¾é¢˜]

In [3]:
#å†™å…¥ä»£ç 
students={'å°çº¢':60,'å°æ˜':40,'ç‹äº”':60,'å¼ ä¸‰':80,'æå››':90}
student_list=pd.Series(students)
student_list

å°çº¢    60
å°æ˜    40
ç‹äº”    60
å¼ ä¸‰    80
æå››    90
dtype: int64

In [9]:
students2={'name':['å°çº¢','å°æ˜','ç‹äº”','å¼ ä¸‰','æå››'],'point':[60,40,60,80,90],'rank':[3,4,3,2,1]}
students_list2=pd.DataFrame(students2)
students_list2

  name  point  rank
0   å°çº¢     60     3
1   å°æ˜     40     4
2   ç‹äº”     60     3
3   å¼ ä¸‰     80     2
4   æå››     90     1

In [10]:
'''
#æˆ‘ä»¬ä¸¾çš„ä¾‹å­
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
example_1 = pd.Series(sdata)
example_1
'''

"\n#æˆ‘ä»¬ä¸¾çš„ä¾‹å­\nsdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}\nexample_1 = pd.Series(sdata)\nexample_1\n"

In [11]:
'''
#æˆ‘ä»¬ä¸¾çš„ä¾‹å­
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
example_2 = pd.DataFrame(data)
example_2
'''

"\n#æˆ‘ä»¬ä¸¾çš„ä¾‹å­\ndata = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],\n        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}\nexample_2 = pd.DataFrame(data)\nexample_2\n"

#### 1.4.2 ä»»åŠ¡äºŒï¼šæ ¹æ®ä¸ŠèŠ‚è¯¾çš„æ–¹æ³•è½½å…¥"train.csv"æ–‡ä»¶

In [22]:
#å†™å…¥ä»£ç 
dt=pd.read_csv('train.csv')
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB

ä¹Ÿå¯ä»¥åŠ è½½ä¸Šä¸€èŠ‚è¯¾ä¿å­˜çš„"train_chinese.csv"æ–‡ä»¶ã€‚é€šè¿‡ç¿»è¯‘ç‰ˆtrain_chinese.csvç†Ÿæ‚‰äº†è¿™ä¸ªæ•°æ®é›†ï¼Œç„¶åæˆ‘ä»¬å¯¹trian.csvæ¥è¿›è¡Œæ“ä½œ
#### 1.4.3 ä»»åŠ¡ä¸‰ï¼šæŸ¥çœ‹DataFrameæ•°æ®çš„æ¯åˆ—çš„é¡¹

In [23]:
#å†™å…¥ä»£ç 
dt.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4ä»»åŠ¡å››ï¼šæŸ¥çœ‹"cabin"è¿™åˆ—çš„æ‰€æœ‰é¡¹ [æœ‰å¤šç§æ–¹æ³•]

In [27]:
#å†™å…¥ä»£ç 
dt['Cabin'].head(5)

0    NaN
1    C85
2    NaN
Name: Cabin, dtype: object

In [28]:
#å†™å…¥ä»£ç 
dt.Cabin.head(3)

0    NaN
1    C85
2    NaN
Name: Cabin, dtype: object

#### 1.4.5 ä»»åŠ¡äº”ï¼šåŠ è½½æ–‡ä»¶"test_1.csv"ï¼Œç„¶åå¯¹æ¯”"train.csv"ï¼Œçœ‹çœ‹æœ‰å“ªäº›å¤šå‡ºçš„åˆ—ï¼Œç„¶åå°†å¤šå‡ºçš„åˆ—åˆ é™¤
ç»è¿‡æˆ‘ä»¬çš„è§‚å¯Ÿå‘ç°ä¸€ä¸ªæµ‹è¯•é›†test_1.csvæœ‰ä¸€åˆ—æ˜¯å¤šä½™çš„ï¼Œæˆ‘ä»¬éœ€è¦å°†è¿™ä¸ªå¤šä½™çš„åˆ—åˆ å»

In [37]:
#å†™å…¥ä»£ç 
dt1=pd.read_csv('test_1.csv')
dt1.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'a'],
      dtype='object')

In [38]:
#å†™å…¥ä»£ç 
del dt1['a']
dt1.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

ã€æ€è€ƒã€‘è¿˜æœ‰å…¶ä»–çš„åˆ é™¤å¤šä½™çš„åˆ—çš„æ–¹å¼å—ï¼Ÿ

In [35]:
# æ€è€ƒå›ç­”
dt1.drop(columns = ['a'],axis=1,inplace=True)#å¦‚æœinplace=Flaseï¼Œåˆ™åŸæ•°æ®é›†ä¸å˜
dt1.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.6 ä»»åŠ¡å…­ï¼š å°†['PassengerId','Name','Age','Ticket']è¿™å‡ ä¸ªåˆ—å…ƒç´ éšè—ï¼Œåªè§‚å¯Ÿå…¶ä»–å‡ ä¸ªåˆ—å…ƒç´

In [39]:
#å†™å…¥ä»£ç 
dt.drop(columns=['PassengerId','Name','Age','Ticket'],axis=1).head(3)

   Survived  Pclass     Sex  SibSp  Parch     Fare Cabin Embarked
0         0       3    male      1      0   7.2500   NaN        S
1         1       1  female      1      0  71.2833   C85        C
2         1       3  female      0      0   7.9250   NaN        S

ã€æ€è€ƒã€‘å¯¹æ¯”ä»»åŠ¡äº”å’Œä»»åŠ¡å…­ï¼Œæ˜¯ä¸æ˜¯ä½¿ç”¨äº†ä¸ä¸€æ ·çš„æ–¹æ³•(å‡½æ•°)ï¼Œå¦‚æœä½¿ç”¨ä¸€æ ·çš„å‡½æ•°å¦‚ä½•å®Œæˆä¸Šé¢çš„ä¸åŒçš„è¦æ±‚å‘¢ï¼Ÿ

dt1.drop(columns = ['a'],axis=1,inplace=True)ä¸­ï¼Œå¦‚æœinplace=Flaseï¼Œåˆ™åŸæ•°æ®é›†ä»…éšè—å¯¹åº”åˆ—(æ•°æ®é›†ä¸å˜)ï¼Œå¦åˆ™å°†ä»åŸæ•°æ®é›†åˆ é™¤å¯¹åº”åˆ—(æ•°æ®é›†å‘ç”Ÿæ”¹å˜)

ã€æ€è€ƒå›ç­”ã€‘

å¦‚æœæƒ³è¦å®Œå…¨çš„åˆ é™¤ä½ çš„æ•°æ®ç»“æ„ï¼Œä½¿ç”¨inplace=Trueï¼Œå› ä¸ºä½¿ç”¨inplaceå°±å°†åŸæ•°æ®è¦†ç›–äº†ï¼Œæ‰€ä»¥è¿™é‡Œæ²¡æœ‰ç”¨

### 1.5 ç­›é€‰çš„é€»è¾‘

è¡¨æ ¼æ•°æ®ä¸­ï¼Œæœ€é‡è¦çš„ä¸€ä¸ªåŠŸèƒ½å°±æ˜¯è¦å…·æœ‰å¯ç­›é€‰çš„èƒ½åŠ›ï¼Œé€‰å‡ºæˆ‘æ‰€éœ€è¦çš„ä¿¡æ¯ï¼Œä¸¢å¼ƒæ— ç”¨çš„ä¿¡æ¯ã€‚

ä¸‹é¢æˆ‘ä»¬è¿˜æ˜¯ç”¨å®æˆ˜æ¥å­¦ä¹ pandasè¿™ä¸ªåŠŸèƒ½ã€‚

#### 1.5.1 ä»»åŠ¡ä¸€ï¼š æˆ‘ä»¬ä»¥"Age"ä¸ºç­›é€‰æ¡ä»¶ï¼Œæ˜¾ç¤ºå¹´é¾„åœ¨10å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯ã€‚

In [55]:
#å†™å…¥ä»£ç 
dt[dt.Age<10].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q

#### 1.5.2 ä»»åŠ¡äºŒï¼š ä»¥"Age"ä¸ºæ¡ä»¶ï¼Œå°†å¹´é¾„åœ¨10å²ä»¥ä¸Šå’Œ50å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯æ˜¾ç¤ºå‡ºæ¥ï¼Œå¹¶å°†è¿™ä¸ªæ•°æ®å‘½åä¸ºmidage

In [63]:
#å†™å…¥ä»£ç 
midage=dt[(dt.Age>=10)&(dt.Age<50)]
midage.Age.describe()

count    578.000000
mean      28.882353
std        9.139303
min       10.000000
25%       22.000000
50%       28.000000
75%       35.000000
max       49.000000
Name: Age, dtype: float64

ã€æç¤ºã€‘äº†è§£pandasçš„æ¡ä»¶ç­›é€‰æ–¹å¼ä»¥åŠå¦‚ä½•ä½¿ç”¨äº¤é›†å’Œå¹¶é›†æ“ä½œ

#### 1.5.3 ä»»åŠ¡ä¸‰ï¼šå°†midageçš„æ•°æ®ä¸­ç¬¬100è¡Œçš„"Pclass"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [65]:
#å†™å…¥ä»£ç 
midage.reset_index(drop=True)#å¯¹æ•°æ®é›†æ’åºé‡æ–°å»ºç«‹ç´¢å¼•
midage.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
midage.loc[[100],['Pclass','Sex']]

     Pclass     Sex
100       3  female

ã€æ€è€ƒã€‘è¿™ä¸ªreset_index()å‡½æ•°çš„ä½œç”¨æ˜¯ä»€ä¹ˆï¼Ÿå¦‚æœä¸ç”¨è¿™ä¸ªå‡½æ•°ï¼Œä¸‹é¢çš„ä»»åŠ¡ä¼šå‡ºç°ä»€ä¹ˆæƒ…å†µï¼Ÿ
æ•°æ®æ¸…æ´—æ—¶ï¼Œä¼šå°†å¸¦ç©ºå€¼çš„è¡Œåˆ é™¤ï¼Œæ­¤æ—¶DataFrameæˆ–Seriesç±»å‹çš„æ•°æ®ä¸å†æ˜¯è¿ç»­çš„ç´¢å¼•ï¼Œå¯ä»¥ä½¿ç”¨reset_index()é‡ç½®ç´¢å¼•ã€‚

#### 1.5.4 ä»»åŠ¡å››ï¼šå°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [67]:
#å†™å…¥ä»£ç 
midage.loc[[100,105,108],['Pclass','Name','Sex']]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male

ã€æç¤ºã€‘ä½¿ç”¨pandasæå‡ºçš„ç®€å•æ–¹å¼ï¼Œä½ å¯ä»¥çœ‹çœ‹locæ–¹æ³•

å¯¹æ¯”æ•´ä½“çš„æ•°æ®ä½ç½®ï¼Œä½ æœ‰å‘ç°ä»€ä¹ˆé—®é¢˜å—ï¼Ÿé‚£ä¹ˆå¦‚ä½•è§£å†³ï¼Ÿ

1.locï¼šé€šè¿‡è¡Œæ ‡ç­¾ç´¢å¼•è¡Œæ•°æ®
ä¾‹ï¼šloc[n]è¡¨ç¤ºç´¢å¼•çš„æ˜¯ç¬¬nè¡Œï¼ˆindex æ˜¯æ•´æ•°ï¼‰
loc[â€˜dâ€™]è¡¨ç¤ºç´¢å¼•çš„æ˜¯ç¬¬â€™dâ€™è¡Œï¼ˆindex æ˜¯å­—ç¬¦ï¼‰
æœ‰è¡Œç´¢å¼•å¯ä»¥æ²¡æœ‰å­—æ®µå–å€¼ï¼Œä½†æœ‰å­—æ®µå–å€¼å‰å¿…é¡»å¾—æœ‰è¡Œç´¢å¼•ï¼Œ
è€Œä¸”è¡Œç´¢å¼•åªèƒ½ä¸ºæ ‡ç­¾ç´¢å¼•å½¢å¼æ¥å–ï¼Œä¸èƒ½æŒ‰åˆ‡ç‰‡å½¢å¼æ¥å–ã€‚
å•å–åˆ‡ç‰‡å½¢å¼å¯ä»¥ï¼Œåªæ˜¯ç´¢å¼•ä¸ºå·¦é—­å³é—­ã€‚

2.ilocï¼šé€šè¿‡è¡Œç´¢å¼•è·å–è¡Œæ•°æ®ï¼Œä¸èƒ½æ˜¯å­—ç¬¦ï¼Œå–ç´¢å¼•å¿…é¡»æŒ‰åˆ‡ç‰‡å½¢å¼æ¥å–ï¼Œä¸èƒ½æŒ‰æ ‡ç­¾ï¼Œè¿™æ˜¯ä¸locçš„ä¸åŒã€‚ç´¢å¼•ä¸ºå·¦é—­å³å¼€ã€‚ilocä¹Ÿå¯ä»¥å–æŒ‡å®šè¡Œåˆ—ï¼Œåªä¸è¿‡å¾—æŒ‰åˆ‡ç‰‡å½¢å¼ç´¢å¼•ï¼Œä¸èƒ½ç›´æ¥æ‹¿æ ‡ç­¾ç´¢å¼•æ¥åšã€‚

å»ºè®®ï¼š
å½“ç”¨è¡Œç´¢å¼•çš„æ—¶å€™, å°½é‡ç”¨ iloc æ¥è¿›è¡Œç´¢å¼•; è€Œç”¨æ ‡ç­¾ç´¢å¼•çš„æ—¶å€™ç”¨ loc ã€‚

#### 1.5.5 ä»»åŠ¡äº”ï¼šä½¿ç”¨ilocæ–¹æ³•å°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [70]:
#å†™å…¥ä»£ç 
midage.iloc[[100,105,108],[2,3,4]]

     Pclass                               Name   Sex
149       2  Byles, Rev. Thomas Roussel Davids  male
160       3           Cribb, Mr. John Hatfield  male
163       3                    Calic, Mr. Jovo  male